VerifiableSecretSharingComposite_tab_title=Verifiable Secret Sharing

VerifiableSecretSharingComposite_description=Verifiable Secret Sharing ist ein Secret Sharing Algorithmus. Das Geheimnis wird so verteilt,\r\ndass jede Person seinen eigenen eindeutigen Teil bekommt. Zus\u00E4tzlich hat jede Person die\r\nM\u00F6glichkeit zu \u00FCberpr\u00FCfen, ob die Teile der anderen Personen korrekt sind. F\u00FCr die Rekonstruktion\r\nwird nur eine zu Beginn festgelegte Zahl der verschiedenen Teile ben\u00F6tigt.\r\nDas Geheimnis wird mit Hilfe der Lagrange-Interpolation berechnet.
VerifiableSecretSharingComposite_restart_button=Neustart
VerifiableSecretSharingComposite_parameters_title=Parameter
VerifiableSecretSharingComposite_coefficients_title=Koeffizienten
VerifiableSecretSharingComposite_commitments_title=Commitments
VerifiableSecretSharingComposite_shares_title=Shares
VerifiableSecretSharingComposite_reconstruction_title=Rekonstruktion
VerifiableSecretSharingComposite_description_title=Erkl\u00E4rungen
VerifiableSecretSharingComposite_description_tooltip=Zus\u00E4tzliche Informationen
VerifiableSecretSharingComposite_description_text_param=Wahl der Parameter:\n\nSpieler n: Hier wird die Anzahl von Spielern festgelegt, die einen Teil des Geheimnisses erhalten soll. Es m\u00FCssen mindestens 2 Spieler sein.\r\nSpieler t f\u00FCr die Rekonstruktion: Hier wird festgelegt, wie viele Spieler f\u00FCr die Rekonstruktion des Geheimnisses ben\u00F6tigt werden. Es m\u00FCssen wieder mindestens 2 sein, allerdings wird dies durch die Anzahl der gesamten Spieler begrenzt.\r\nGeheimnis s: Das Geheimnis s muss eine nat\u00FCrliche ganze Zahl sein.\r\nModul p: Der Modul p muss eine Primzahl sein, die gr\u00F6\u00DFer als das Geheimnis s ist.\r\nPrimitivwurzel g: Als Primitivwurzeln werden in der Zahlentheorie bestimmte Elemente von primen Restklassengruppen bezeichnet. Die definierende Eigenschaft einer Primitivwurzel ist, dass jedes Element der primen Restklassengruppe als Potenz der Primitivwurzel dargestellt werden kann.
VerifiableSecretSharingComposite_description_text_coefficients=Wahl der Koeffizienten:\n\nDie Wahl der Koeffizienten kann automatisch durch einen Klick auf "Generieren" erfolgen.\rn\nAlternativ k\u00F6nnen die Koeffizienten auch selbst gew\u00E4hlt werden, wobei zu beachten ist, dass die Koeffizienten kleiner als der Modul p sind. Bei P(x) wird das Polynom angezeigt.
VerifiableSecretSharingComposite_description_text_comittments=Die Commitments werden mit der Formel g^a_i mod p berechnet.\r\nIn der Folge werden die Commitments zum Pr\u00FCen der Shares verwendet.
VerifiableSecretSharingComposite_description_text_shares=Die Shares sind die Funktionswerte der der ID's der Spieler.\r\nEs werden hier die tats\u00E4chlichen Shares und die Shares mod p angezeigt.\r\nDie Überpr\u00FCfung der Shares erfolgt \u00FCber den jeweiligen "Check"-Button. Nach der Überpr\u00FCfung wird der Share gr\u00FCn(richtig) bzw. rot(falsch) markiert.
VerifiableSecretSharingComposite_description_text_reconstruction=Die Rekonstruktion wird mit Hilfe der Lagrange-Interpolation durchgef\u00FChrt.\r\nNachdem ausreichend Shares ausgew\u00E4hlt wurden (mind. t Shares) kann die Rekonstruktion durchgef\u00FChrt werden.\r\nUm das korrekte Geheimnis wiederherstellen zu k\u00F6nnen, m\u00FCssen alle ausgew\u00E4hlten Shares korrekt sein.


VerifiableSecretSharingComposite_parameters_players=Spieler n
VerifiableSecretSharingComposite_parameters_reconstructors=Spieler zur Rekonstruktion t
VerifiableSecretSharingComposite_parameters_secret=Geheimnis s
VerifiableSecretSharingComposite_parameters_primeMod=Modul p (p Primzahl, p>s)
VerifiableSecretSharingComposite_parameters_primitiveRoot=Primitivwurzel g modulo p
VerifiableSecretSharingComposite_parameters_determineCoefficients=Koeffizienten bestimmen

VerifiableSecretSharingComposite_nextStep_button=N\u00E4chster Schritt:

VerifiableSecretSharingComposite_coefficients_generate_button=Generieren
VerifiableSecretSharingComposite_coefficients_commit_button=Commit
VerifiableSecretSharingComposite_coefficients_calculateShares_button=Shares berechnen
	
VerifiableSecretSharingComposite_commitments_coefficient_subtitle=Koeffizient
VerifiableSecretSharingComposite_commitments_commitment_subtitle=Commitment y\u1D6A
	
VerifiableSecretSharingComposite_shares_shareNModP_subtitle=Share N\u1D62 [mod p]
VerifiableSecretSharingComposite_shares_check_button=Check

VerifiableSecretSharingComposite_playerX=Spieler
	
VerifiableSecretSharingComposite_reconstruction_reconstruct_button=Rekonstruieren

VerifiableSecretSharingComposite_error_start=Die folgenden Bedingungen m\u00FCssen erf\u00FCllt sein:
		
VerifiableSecretSharingComposite_param_player_n_positive=Die Anzahl der Spieler muss eine nat\u00FCrliche Zahl sein!
VerifiableSecretSharingComposite_param_player_n_bigger_2=Die Anzahl der Spieler muss mindestens 2 sein!
VerifiableSecretSharingComposite_param_player_t_smaller_n=Die Anzahl der Spieler die f\u00FCr die Rekonstruktion ben\u00F6tigt werden, darf nicht gr\u00F6\u00DFer als die Anzahl der gesamten Spieler sein!
VerifiableSecretSharingComposite_param_secret_s_positive=Das Geheimnis s muss eine nat\u00FCrliche Zahl sein!
VerifiableSecretSharingComposite_param_module_p_bigger_s=Der Modul p muss gr\u00F6\u00DFer als das Geheimnis sein!
VerifiableSecretSharingComposite_param_module_p_isPrime=Der Modul p muss eine Primzahl sein!
VerifiableSecretSharingComposite_param_primitive_g=g muss eine Primitivwurzel modulo p sein!
VerifiableSecretSharingComposite_param_set_all=Es m\u00FCssen alle Parameter gew\u00E4hlt werden um fortfahren zu k\u00F6nnen!
	
VerifiableSecretSharingComposite_coefficient_positive=Die Koeffizienten m\u00FCssen nat\u00FCrliche Zahlen sein!
VerifiableSecretSharingComposite_coefficient_smaller_p=Die Koeffizienten m\u00FCssen kleiner sein als der Modul p! 
VerifiableSecretSharingComposite_coefficient_set_all=Es m\u00FCssen alle Koeffizienten bestimmt werden!

ChartComposite_tab_title=Rekonstruktionsgraph